Revit 2027 API
ZoneEquipment.GetZoneEquipmentData Method
 Gets the zone equipment data.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoneEquipmentData GetZoneEquipmentData()
Public Function GetZoneEquipmentData As ZoneEquipmentData
public:
ZoneEquipmentData^ GetZoneEquipmentData()
member GetZoneEquipmentData : unit -> ZoneEquipmentData
Return Value
ZoneEquipmentData
See Also
Reference
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace